app/views/entries/show.html.erb

<div class="journal-entry">
  <h4>Created By: <%= @entry.user.first_name %> <%= @entry.user.last_name %></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

    <!-- If there are comments on the entry, they are displayed -->
  <% if @entry.comments.length > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 1]]