app/views/users/journal.html.erb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]
---

  <% if @user.entries.length > 0 %>