app/views/users/show.html.erb

      the current user's journal entries. -->
  <% @user.entries.each do |entry| %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 4]]