app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "entry_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["entry_id", 1], ["content", "Nice entry!"], ["created_at", 2017-02-24 05:51:10 UTC], ["updated_at", 2017-02-24 05:51:10 UTC]]
---
  def create
    @comment = @entry.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = ? AND "comments"."id" = ? LIMIT ?  [["entry_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def destroy
    @entry.comments.find(params[:id]).destroy

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_entry
    @entry = Entry.find(params[:entry_id])