app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
---
  def index
    if current_user && Entry.of_followed_users(current_user.following).length > 0

INSERT INTO "entries" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "This is a title!"], ["content", "This is some content..."], ["created_at", 2017-02-23 03:40:09 UTC], ["updated_at", 2017-02-23 03:40:09 UTC]]
---
  def create
    @entry = Entry.new(user_id: current_user.id)
    @entry.update(entry_params)
    if @entry.save

UPDATE "entries" SET "content" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["content", "This is content....."], ["updated_at", 2017-02-23 19:20:51 UTC], ["id", 2]]
---
  def update
    if @entry.update(entry_params)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_entry
    @entry = Entry.find_by(id: params[:id])