app/controllers/places_controller.rb

  def index
    if current_user
      if Place.of_followed_users(current_user.following).length > 0
---
SELECT "places".* FROM "places" ORDER BY created_at asc

  def create
    @place = Place.new(user_id: current_user.id)
    @place.update(place_params)
    if @place.save
---
INSERT INTO "places" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Greece"], ["user_id", 4], ["created_at", 2017-02-25 03:26:09 UTC], ["updated_at", 2017-02-25 03:26:09 UTC]]

  def set_place
    @place = Place.find_by(id: params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]