app/controllers/posts_controller.rb

INSERT INTO "posts" ("place_id", "link", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["place_id", 2], ["link", ""], ["description", "very pretty!"], ["created_at", 2017-02-25 22:32:11 UTC], ["updated_at", 2017-02-25 22:32:11 UTC]]
---
  def create
    @post = Post.new(place_id: @place.id)
    @post.update(post_params)
    if @post.save

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_place
    @place = Place.find(params[:place_id])