app/controllers/search_controller.rb

SELECT "users".* FROM "users" WHERE (first_name LIKE '%rory%' OR last_name LIKE '%rory%' OR email LIKE '%rory%') ORDER BY created_at DESC
SELECT "places".* FROM "places" WHERE (name LIKE '%l%') ORDER BY created_at DESC
SELECT "posts".* FROM "posts" WHERE (description LIKE '%gilmore%' OR link LIKE '%gilmore%') ORDER BY created_at DESC
SELECT "entries".* FROM "entries" WHERE (title LIKE '%rory%') ORDER BY created_at DESC
---
  def search
    @users = User.search(params[:search]).order("created_at DESC")
    @places = Place.search(params[:search]).order("created_at DESC")
    @posts = Post.search(params[:search]).order("created_at DESC")
    @entries = Entry.search(params[:search]).order("created_at DESC")