app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (first_name LIKE '%rory%' OR last_name LIKE '%rory%' OR email LIKE '%rory%') ORDER BY created_at DESC

  def show
    @places = @user.places.order("created_at asc")
---
SELECT "places".* FROM "places" WHERE "places"."user_id" = ? ORDER BY created_at desc  [["user_id", 4]]