app/controllers/welcome_controller.rb

  def home
    if current_user
      @entries = Entry.of_followed_users(current_user.following).order('created_at DESC')
    else
      @entries = Entry.all
---
SELECT "entries".* FROM "entries"